In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('FoodBalanceSheets_E_Africa_NOFLAG.csv',encoding='latin-1')
df.head()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.00,39728.00,40551.00,41389.00,42228.00
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.00,0.00,0.00,0.00,0.00
2,4,Algeria,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,3377.00,3379.00,3372.00,3341.00,3322.00
3,4,Algeria,2901,Grand Total,674,Protein supply quantity (g/capita/day),g/capita/day,94.90,94.35,94.72,92.82,91.83
4,4,Algeria,2901,Grand Total,684,Fat supply quantity (g/capita/day),g/capita/day,80.06,79.36,77.40,80.19,77.28

**Question 1**

What is the total number and percentage of missing data in 2014 to 3 decimal places?

In [17]:
print(f"Total number of missing data in 2014 is {df.isnull().sum()['Y2014']}")
print(f"The percentage of missing data in 2014 is {round(df.isnull().sum()['Y2014']/len(df)*100,3)}%")

Total number of missing data in 2014 is 1589
The percentage of missing data in 2014 is 2.607%

**Question 2**

How would you check for the number of rows and columns in a pandas DataFrame named df?

In [18]:
df.shape

(60943, 12)

**Question 3**

If you have the following list

lst = [[35, 'Portugal', 94], [33, 'Argentina', 93], [30 , 'Brazil', 92]]

col = [‘Age’,’Nationality’,’Overall’]

How do you create a pandas DataFrame using this list, to look like the table below?

In [22]:
lst = [[35, 'Portugal', 94], [33, 'Argentina', 93], [30 , 'Brazil', 92]]
col = ['Age','Nationality','Overall']

pd.DataFrame(lst, columns = col, index = [i for i in range(1,4)])

   Age Nationality  Overall
1   35    Portugal       94
2   33   Argentina       93
3   30      Brazil       92

**Question 4**

A pandas Dataframe with dimensions (100,3) has how many features and observations?

**Answer**

3 features, 100 observations

**Question 5**


Consider the following list of tuples:

y = [(2, 4), (7, 8), (1, 5, 9)]

How would you assign element 8 from the list to a variable x?

In [24]:
y = [(2, 4), (7, 8), (1, 5, 9)]
x = y[1][1]
x

8

**Question 6**


Given the following numpy array 

array  = ([[94, 89, 63],

             [93, 92, 48],

             [92, 94, 56]])

How would you select  the elements in bold and italics from the array?

In [25]:
array  = np.array([[94, 89, 63],
                   [93, 92, 48],
                   [92, 94, 56]])
array[:2,1:]

array([[89, 63],
       [92, 48]])

**Question 7**


Perform a groupby operation on ‘Element’.  What year has the highest sum of Stock Variation?

In [26]:
Element_data = df.groupby('Element')[['Y2014','Y2015','Y2016','Y2017','Y2018']].sum().reset_index()
Element_data  = Element_data[Element_data['Element']=='Stock Variation']
Element_data

            Element     Y2014     Y2015     Y2016     Y2017     Y2018
15  Stock Variation  58749.83  34910.99  33140.12  54316.91  20577.91

In [36]:
Element_data[['Y2014','Y2015','Y2016','Y2017','Y2018']].max(axis=1)

15    58749.83
dtype: float64

**Question 8**

Which of these python data structures is unorderly?

**Answer**

Set

**Question 9**

Which of the following is a python inbuilt module?

**Answer**

math

**Question 10**


What is the total Protein supply quantity in Madagascar in 2015?

In [38]:
df[df.Area == 'Madagascar'].groupby('Element').sum()['Y2015']['Protein supply quantity (g/capita/day)']

173.05

**Question 11**

What is the total sum of Wine produced in 2015 and 2018 respectively?

Hint:

Perform a groupby sum aggregation on ‘Item’

In [40]:
Wine = df[df.Item == 'Wine']
Wine.groupby('Item')[['Y2015','Y2018']].sum()

        Y2015    Y2018
Item
Wine  4251.81  4039.32

**Question 12**

Which of the following dataframe methods can be used to access elements across rows and columns?

**Answer**

df.iloc[:]

**Question 13**


What would be the output for?

S = [['him', 'sell'], [90, 28, 43]]

S[0][1][1]

In [44]:
S = [['him', 'sell'], [90, 28, 43]]

S[0][1][1]

'e'

**Question 14**

Select columns ‘Y2017’ and ‘Area’, Perform a groupby operation on ‘Area’.  Which of these Areas had the 7th lowest sum in 2017?

In [45]:
df[['Area','Y2017']].groupby('Area').sum().sort_values(by='Y2017').head(7)

                          Y2017
Area
Sudan (former)             0.00
Ethiopia PDR               0.00
Comoros                   59.84
Seychelles               442.34
Sao Tome and Principe  12662.63
Cabo Verde             14650.74
Guinea-Bissau          19102.77

In [46]:
df[['Area','Y2017']].groupby('Area').sum().sort_values(by='Y2017').reset_index().iloc[6]

Area     Guinea-Bissau
Y2017         19102.77
Name: 6, dtype: object

**Question 15**


Select columns ‘Y2017’ and ‘Area’, Perform a groupby operation on ‘Area’.  Which of these Areas had the highest sum in 2017?

In [49]:
df[['Area','Y2017']].groupby('Area').sum().sort_values(by='Y2017', ascending=False).reset_index().head(1)

      Area       Y2017
0  Nigeria  1483268.23

**Question 16**

What is the total number of unique countries in the dataset?

In [50]:
df.Area.nunique()

49

**Question 17**

Given the following python code, what would the output of the code give?

my_tuppy = (1,2,5,8)

my_tuppy[2] = 6

**Answer**

TypeError

**Question 18**


Which year had the least correlation with ‘Element Code’?

In [60]:
df[['Element Code','Y2014','Y2015','Y2016','Y2017','Y2018']].corr()['Element Code'].min()

0.02344399758496104

In [98]:
df[['Element Code','Y2014','Y2015','Y2016','Y2017','Y2018']].corr()[['Element Code']].reset_index().nsmallest(1,columns='Element Code')

   index  Element Code
3  Y2016      0.023444

**Question 19**

What is the mean and standard deviation across the whole dataset for the year 2017 to 2 decimal places?

In [73]:
round(df.describe()[['Y2017']].loc['mean':'std'],2)

        Y2017
mean   140.92
std   1671.86

In [86]:
print(f"The mean and standard deviation of 2017 is mean: {round(df.describe()['Y2017'].loc['mean'],2)}, standard deviation : {round(df.describe()['Y2017'].loc['std'],2)}")

The mean and standard deviation of 2017 is mean: 140.92, standard deviation : 1671.86

**Question 20**

Perform a groupby operation on ‘Element’.  What is the total number of the sum of Processing in 2017?

In [66]:
Processing = df.groupby('Element').sum()[['Y2017']].reset_index()
Processing[Processing['Element'] == 'Processing']

       Element     Y2017
10  Processing  292836.0